PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
/*!
    \file    gd32f3x0_hal_smbus.c
    \brief   SMBUS driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/* wait the flag status until timeout */
static int32_t _smbus_wait_flag_timeout(uint32_t smbus_periph, i2c_flag_enum flag, \
                                        FlagStatus status, uint32_t timeout_ms);
/* event handler in SMBUS master transmit mode */
static void _smbus_master_transmit_interrupt(void *smbus);
/* event handler in SMBUS slave transmit mode */
static void _smbus_slave_transmit_interrupt(void *smbus);
/* event handler in SMBUS master receive mode */
static void _smbus_master_receive_interrupt(void *smbus);
/* event handler in SMBUS slave receive mode */
static void _smbus_slave_receive_interrupt(void *smbus);

/*!
    \brief      initialize the SMBUS structure with the default values
    \param[in]  struct_type: refer to hal_smbus_struct_type_enum
    \param[in]  p_struct: point to SMBUS structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_smbus_struct_init(hal_smbus_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_SMBUS_INIT_STRUCT:
        /* initialize SMBUS initialization structure with the default values */
        ((hal_smbus_init_struct *)p_struct)->own_address1 = 0;
        ((hal_smbus_init_struct *)p_struct)->own_address2 = 0;
        ((hal_smbus_init_struct *)p_struct)->dual_address = SMBUS_DUADEN_DISABLE;
        ((hal_smbus_init_struct *)p_struct)->clock_speed = 100000;
        ((hal_smbus_init_struct *)p_struct)->address_format = SMBUS_ADDFORMAT_7BITS;
        ((hal_smbus_init_struct *)p_struct)->smbus_type = SMBUS_DEVICE;
        ((hal_smbus_init_struct *)p_struct)->smbus_pec = SMBUS_PEC_DISABLE;
        ((hal_smbus_init_struct *)p_struct)->smbus_arp = SMBUS_ARP_DISABLE;
        ((hal_smbus_init_struct *)p_struct)->general_call = SMBUS_GCEN_DISABLE;
        ((hal_smbus_init_struct *)p_struct)->no_stretch = SMBUS_SCLSTRETCH_DISABLE;

        break;

    case HAL_SMBUS_DEV_STRUCT:
        /* initialize SMBUS device information structure with the default values */
        ((hal_smbus_dev_struct *)p_struct)->periph = 0;
        ((hal_smbus_dev_struct *)p_struct)->smbus_irq.event_handle = NULL;
        ((hal_smbus_dev_struct *)p_struct)->smbus_irq.error_handle = NULL;
        ((hal_smbus_dev_struct *)p_struct)->txbuffer.buffer = NULL;
        ((hal_smbus_dev_struct *)p_struct)->txbuffer.length = 0;
        ((hal_smbus_dev_struct *)p_struct)->txbuffer.pos = 0;
        ((hal_smbus_dev_struct *)p_struct)->rxbuffer.buffer = NULL;
        ((hal_smbus_dev_struct *)p_struct)->rxbuffer.length = 0;
        ((hal_smbus_dev_struct *)p_struct)->rxbuffer.pos = 0;
        ((hal_smbus_dev_struct *)p_struct)->smbus_pec_transfer = SMBUS_PECTRANS_DISABLE;
        ((hal_smbus_dev_struct *)p_struct)->error_state = HAL_SMBUS_ERROR_NONE;
        ((hal_smbus_dev_struct *)p_struct)->tx_state = HAL_SMBUS_STATE_FREE;
        ((hal_smbus_dev_struct *)p_struct)->rx_state = HAL_SMBUS_STATE_FREE;
        ((hal_smbus_dev_struct *)p_struct)->last_error = HAL_SMBUS_ERROR_NONE;
        ((hal_smbus_dev_struct *)p_struct)->priv = NULL;     /* priv data */
        ((hal_smbus_dev_struct *)p_struct)->mutex = HAL_MUTEX_UNLOCKED;

        break;

    case HAL_SMBUS_IRQ_STRUCT:
        /* initialize SMBS irq structure with the default values */
        ((hal_smbus_irq_struct *)p_struct)->error_handle = NULL;
        ((hal_smbus_irq_struct *)p_struct)->event_handle = NULL;

        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize SMBUS
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_deinit(hal_smbus_dev_struct *smbus_dev)
{
    uint32_t periph;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

