PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
    periph = smbus_dev->periph;
    if(I2C0 == periph) {
        hal_rcu_periph_reset_enable(RCU_I2C0RST);
        hal_rcu_periph_reset_disable(RCU_I2C0RST);

        hal_smbus_struct_init(HAL_SMBUS_DEV_STRUCT, smbus_dev);
        smbus_dev->periph = periph;
    } else if(I2C1 == periph) {
        hal_rcu_periph_reset_enable(RCU_I2C1RST);
        hal_rcu_periph_reset_disable(RCU_I2C1RST);

        hal_smbus_struct_init(HAL_SMBUS_DEV_STRUCT, smbus_dev);
        smbus_dev->periph = periph;
    } else {
        HAL_DEBUGE("parameter [smbus_dev->periph] value is invalid");
    }
}

/*!
    \brief      initialize SMBUS
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which SMBUS is initialized
    \param[in]  smbus_init: the initialization data needed to initialize SMBUS
                  own_address1: SMBUS address
                  own_address2: the second address in dual-address mode
                  clock_speed: SMBUS clock speed, supports standard mode (up to 100 kHz)
                  address_format: SMBUS_ADDFORMAT_7BITS, SMBUS_ADDFORMAT_10BITS
                  smbus_type: SMBUS_DEVICE, SMBUS_HOST
                  dual_address: SMBUS_DUADEN_ENABLE, SMBUS_DUADEN_DISABLE
                  smbus_pec: SMBUS_PEC_ENABLE, SMBUS_PEC_DISABLE
                  smbus_arp: SMBUS_ARP_ENABLE, SMBUS_ARP_DISABLE
                  general_call: SMBUS_GCEN_ENABLE, SMBUS_GCEN_DISABLE
                  no_stretch: SMBUS_SCLSTRETCH_ENABLE, SMBUS_SCLSTRETCH_DISABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_init(hal_smbus_dev_struct *smbus_dev, uint32_t periph, \
                       hal_smbus_init_struct *smbus_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) && (NULL == smbus_init)) {
        HAL_DEBUGE("pointer [smbus_dev] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    if((I2C0 != periph) && (I2C1 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }

    if(0 != smbus_dev->periph) {
        HAL_DEBUGI("periph value from smbus device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    smbus_dev->periph = periph;

    /* disable peripheral */
    HAL_I2C_DISABLE(periph);

    hals_i2c_clock_config(periph, smbus_init->clock_speed, I2C_DTCY_2);

    smbus_init->own_address1 = smbus_init->own_address1 << 1;
    hals_i2c_mode_addr_config(periph, I2C_SMBUSMODE_ENABLE, smbus_init->address_format, smbus_init->own_address1);

    /* configure dual-address mode */
    if(SMBUS_DUADEN_ENABLE == smbus_init->dual_address) {
        smbus_init->own_address2 = smbus_init->own_address2 << 1;
        hals_i2c_dualaddr_enable(periph, smbus_init->own_address2);
    } else {
        hals_i2c_dualaddr_disable(periph);
    }
    /* configure whether to stretch SCL low when data is not ready in slave mode */
    hals_i2c_stretch_scl_low_config(periph, smbus_init->no_stretch);
    /* whether or not to response to a general call */
    hals_i2c_slave_response_to_gcall_config(periph, smbus_init->general_call);

    hals_i2c_smbus_type_config(periph, smbus_init->smbus_type);

    hals_i2c_pec_config(periph, smbus_init->smbus_pec);

    hals_i2c_smbus_arp_enable(periph, smbus_init->smbus_arp);

    /* enable peripheral */
    HAL_I2C_ENABLE(periph);
    /* enable acknowledge */
    hals_i2c_ack_config(periph, SMBUS_ACK_ENABLE);

    smbus_dev->tx_state = HAL_SMBUS_STATE_READY;
    smbus_dev->rx_state = HAL_SMBUS_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      Enable the SMBUS alert mode with Interrupt.
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_enable_alert_interrupt(hal_smbus_dev_struct *smbus_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* Enable SMBus alert */
    hals_i2c_smbus_alert_config(smbus_dev->periph, I2C_SALTSEND_ENABLE);

    /* Clear ALERT flag */
    hals_i2c_flag_clear(smbus_dev->periph, I2C_FLAG_SMBALT);

    /* Enable Alert Interrupt */
    hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_ERR);

    return HAL_ERR_NONE;
}

/*!
    \brief      SMBUS evevt interrupt handler
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_event_irq(hal_smbus_dev_struct *smbus_dev)
{
    if(smbus_dev->smbus_irq.event_handle != NULL) {
        smbus_dev->smbus_irq.event_handle(smbus_dev);
    }
}

/*!
    \brief      SMBUS error interrupt handler
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_error_irq(hal_smbus_dev_struct *smbus_dev)
{
    /* PEC error */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_PECERR) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_PECERR);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_PECERR;
        smbus_dev->last_error = HAL_SMBUS_ERROR_PECERR;
    }

