PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
    /* BERR error */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_BERR) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_BERR);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_BERR;
        smbus_dev->last_error = HAL_SMBUS_ERROR_BERR;
    }

    /* LOSTARB error */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_LOSTARB) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_LOSTARB);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_LOSTARB;
        smbus_dev->last_error = HAL_SMBUS_ERROR_LOSTARB;
    }

    /* AERR error */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_AERR) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_AERR);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_AERR;
        smbus_dev->last_error = HAL_SMBUS_ERROR_AERR;
    }

    /* OUERR error */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_OUERR) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_OUERR);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_OUERR;
        smbus_dev->last_error = HAL_SMBUS_ERROR_OUERR;
    }

    /* SMBUS timeout */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_SMBTO) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_SMBTO);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_SMBTO;
        smbus_dev->last_error = HAL_SMBUS_ERROR_SMBTO;
    }

    /* SMBUS alert */
    if(hals_i2c_interrupt_flag_get(smbus_dev->periph, I2C_INT_FLAG_SMBALT) != RESET) {
        hals_i2c_interrupt_flag_clear(smbus_dev->periph, I2C_INT_FLAG_SMBALT);
        smbus_dev->error_state |= HAL_SMBUS_ERROR_SMBALT;
        smbus_dev->last_error = HAL_SMBUS_ERROR_SMBALT;
    }

    /* SMBUS no error */
    if(smbus_dev->error_state != HAL_SMBUS_ERROR_NONE) {
        if(smbus_dev->smbus_irq.error_handle != NULL) {
            smbus_dev->smbus_irq.error_handle(smbus_dev);
            smbus_dev->error_state = HAL_SMBUS_ERROR_NONE;
        }
    }
}

/*!
    \brief      start SMBUS module function
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval
*/
void hal_smbus_start(hal_smbus_dev_struct *smbus_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    HAL_I2C_ENABLE(smbus_dev->periph);
}

/*!
    \brief      stop SMBUS module function
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval
*/
void hal_smbus_stop(hal_smbus_dev_struct *smbus_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    HAL_I2C_DISABLE(smbus_dev->periph);
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of SMBUS interrupt
    \param[out] none
    \retval     none
*/
void hal_smbus_irq_handle_set(hal_smbus_dev_struct *smbus_dev, hal_smbus_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("parameter [smbus_dev] or [p_irq] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* event handle */
    if(NULL != p_irq->event_handle) {
        smbus_dev->smbus_irq.event_handle = p_irq->event_handle;
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_EV);
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_BUF);
    } else {
        smbus_dev->smbus_irq.event_handle = NULL;
        hals_i2c_interrupt_disable(smbus_dev->periph, I2C_INT_EV);
        hals_i2c_interrupt_disable(smbus_dev->periph, I2C_INT_BUF);
    }

    /* error handle */
    if(NULL != p_irq->error_handle) {
        smbus_dev->smbus_irq.error_handle = p_irq->error_handle;
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_ERR);
    } else {
        smbus_dev->smbus_irq.error_handle = NULL;
        hals_i2c_interrupt_disable(smbus_dev->periph, I2C_INT_ERR);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_irq_handle_all_reset(hal_smbus_dev_struct *smbus_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    smbus_dev->smbus_irq.event_handle = NULL;
    smbus_dev->smbus_irq.error_handle = NULL;
}

/*!
    \brief      SMBUS master transmit in interrupt mode
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_master_transmit_interrupt(hal_smbus_dev_struct *smbus_dev, uint8_t *p_buffer, \
        uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;

