PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [smbus_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* SMBUS state is busy */
    if(HAL_SMBUS_STATE_BUSY == smbus_dev->tx_state) {
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* update the value of SMBUS dev struct */
    smbus_dev->error_state = HAL_SMBUS_ERROR_NONE;
    smbus_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    smbus_dev->txbuffer.length = length;
    smbus_dev->txbuffer.pos = 0;

    /* SMBUS state is ready */
    if(HAL_SMBUS_STATE_READY == smbus_dev->tx_state) {
        HAL_LOCK(smbus_dev);
        smbus_dev->tx_state = HAL_SMBUS_STATE_BUSY;
        smbus_dev->tx_callback = (void *)p_user_func;
        smbus_dev->smbus_irq.event_handle = _smbus_master_transmit_interrupt;

        /* enable the I2C interrupt */
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_EV);

        /* the master waits until the I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* the master sends a start condition to I2C bus */
        HAL_I2C_START_ON_BUS(smbus_dev->periph);
        HAL_UNLOCK(smbus_dev);
        return HAL_ERR_NONE;
    } else {
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS master receive with interrupt
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_master_receive_interrupt(hal_smbus_dev_struct *smbus_dev, uint8_t *p_buffer, \
        uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [smbus_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* SMBUS state is busy */
    if(HAL_SMBUS_STATE_BUSY == smbus_dev->rx_state) {
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* update the values of SMBUS dev struct */
    smbus_dev->error_state = HAL_SMBUS_ERROR_NONE;
    smbus_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    smbus_dev->rxbuffer.length = length;
    smbus_dev->rxbuffer.pos = 0;

    /* SMBUS state is ready */
    if(HAL_SMBUS_STATE_READY == smbus_dev->rx_state) {
        HAL_LOCK(smbus_dev);
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }

        /* update the values of SMBUS dev struct */
        smbus_dev->rx_state = HAL_SMBUS_STATE_BUSY;
        smbus_dev->rx_callback = (void *)p_user_func;
        smbus_dev->smbus_irq.event_handle = _smbus_master_receive_interrupt;

        /* enable the I2C interrupt */
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_EV);

        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }

        if(smbus_dev->rxbuffer.length == 2) {
            /* send a NACK for the next data byte which will be received into the shift register */
            hals_i2c_ackpos_config(I2C0, I2C_ACKPOS_NEXT);

        }

        /* the master sends a start condition to I2C bus */
        HAL_I2C_START_ON_BUS(smbus_dev->periph);
        HAL_UNLOCK(smbus_dev);
        return HAL_ERR_NONE;
    } else {
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS slave transmit in interrupt mode
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_slave_transmit_interrupt(hal_smbus_dev_struct *smbus_dev, uint8_t *p_buffer, \
        uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [smbus_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* SMBUS state is busy */
    if(HAL_SMBUS_STATE_BUSY == smbus_dev->tx_state) {
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* update the values of SMBUS dev struct */
    smbus_dev->error_state = HAL_SMBUS_ERROR_NONE;
    smbus_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    smbus_dev->txbuffer.length = length;
    smbus_dev->txbuffer.pos = 0;

    /* SMBUS state is ready */
    if(HAL_SMBUS_STATE_READY == smbus_dev->tx_state) {
        HAL_LOCK(smbus_dev);
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }

