PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
        /* update the values of SMBUS dev struct */
        smbus_dev->tx_state = HAL_SMBUS_STATE_BUSY;
        smbus_dev->tx_callback = (void *)p_user_func;
        smbus_dev->smbus_irq.event_handle = _smbus_slave_transmit_interrupt;

        /* enable the I2C interrupt */
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_EV);

        HAL_UNLOCK(smbus_dev);
        return HAL_ERR_NONE;
    } else {
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS slave receive with interrupt mode
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_slave_receive_interrupt(hal_smbus_dev_struct *smbus_dev, uint8_t *p_buffer, \
        uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [smbus_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* SMBUS state is busy */
    if(HAL_SMBUS_STATE_BUSY == smbus_dev->rx_state) {
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* update the values of SMBUS dev struct */
    smbus_dev->error_state = HAL_SMBUS_ERROR_NONE;
    smbus_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    smbus_dev->rxbuffer.length = length;
    smbus_dev->rxbuffer.pos = 0;

    /* SMBUS state is ready */
    if(HAL_SMBUS_STATE_READY == smbus_dev->rx_state) {
        HAL_LOCK(smbus_dev);
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }

        /* update the values of SMBUS dev struct */
        smbus_dev->rx_state = HAL_SMBUS_STATE_BUSY;
        smbus_dev->rx_callback = (void *)p_user_func;
        smbus_dev->smbus_irq.event_handle = _smbus_slave_receive_interrupt;

        /* enable the I2C interrupt */
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_enable(smbus_dev->periph, I2C_INT_EV);

        HAL_UNLOCK(smbus_dev);
        return HAL_ERR_NONE;
    } else {
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      Disable the SMBUS alert mode with Interrupt.
    \param[in]  smbus_dev: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_smbus_disable_alert_interrupt(hal_smbus_dev_struct *smbus_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == smbus_dev) {
        HAL_DEBUGE("pointer [smbus_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* Enable SMBus alert */
    hals_i2c_smbus_alert_config(smbus_dev->periph, I2C_SALTSEND_DISABLE);

    /* Disable Alert Interrupt */
    hals_i2c_interrupt_disable(smbus_dev->periph, I2C_INT_ERR);

    return HAL_ERR_NONE;
}

/*!
    \brief      select SMBus type
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  type:
                only one parameter can be selected which is shown as below:
      \arg        I2C_SMBUS_DEVICE: SMBus mode device type
      \arg        I2C_SMBUS_HOST: SMBus mode host type
    \param[out] none
    \retval     none
*/
void hals_i2c_smbus_type_config(uint32_t i2c_periph, uint32_t type)
{
    if(I2C_SMBUS_HOST == type) {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBSEL;
    } else {
        I2C_CTL0(i2c_periph) &= ~(I2C_CTL0_SMBSEL);
    }
}

/*!
    \brief      enable or disable I2C ARP protocol in SMBus switch
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  smbuspara:
                only one parameter can be selected which is shown as below:
      \arg        I2C_ARP_ENABLE: enable ARP
      \arg        I2C_ARP_DISABLE: disable ARP
    \param[out] none
    \retval     none
*/
void hals_i2c_smbus_arp_enable(uint32_t i2c_periph, uint32_t arpstate)
{
    /* enable or disable I2C ARP protocol*/
    uint32_t ctl = 0U;

    ctl = I2C_CTL0(i2c_periph);
    ctl &= ~(I2C_CTL0_ARPEN);
    ctl |= arpstate;
    I2C_CTL0(i2c_periph) = ctl;
}

/*!
    \brief      configure I2C alert through SMBA pin
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  smbuspara:
                only one parameter can be selected which is shown as below:
      \arg        I2C_SALTSEND_ENABLE: issue alert through SMBA pin
      \arg        I2C_SALTSEND_DISABLE: not issue alert through SMBA pin
    \param[out] none
    \retval     none
*/
void hals_i2c_smbus_alert_config(uint32_t i2c_periph, uint32_t smbuspara)
{
    /* configure smbus alert through SMBA pin */
    uint32_t ctl = 0U;

    ctl = I2C_CTL0(i2c_periph);
    ctl &= ~(I2C_CTL0_SALT);
    ctl |= smbuspara;
    I2C_CTL0(i2c_periph) = ctl;
}

/*!
    \brief      configure I2C PEC calculation
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  pecstate:
                only one parameter can be selected which is shown as below:
      \arg        I2C_PEC_ENABLE: PEC calculation on
      \arg        I2C_PEC_DISABLE: PEC calculation off
    \param[out] none
    \retval     none
*/
void hals_i2c_pec_config(uint32_t i2c_periph, uint32_t pecstate)
{
    /* on/off PEC calculation */
    uint32_t ctl = 0U;

    ctl = I2C_CTL0(i2c_periph);
    ctl &= ~(I2C_CTL0_PECEN);
    ctl |= pecstate;
    I2C_CTL0(i2c_periph) = ctl;
}

/*!
    \brief      configure whether to transfer PEC value
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  pecpara:
                only one parameter can be selected which is shown as below:
      \arg        I2C_PECTRANS_ENABLE: transfer PEC value
      \arg        I2C_PECTRANS_DISABLE: not transfer PEC value
    \param[out] none
    \retval     none
*/
void hals_i2c_pec_transfer_config(uint32_t i2c_periph, uint32_t pecpara)
{
    /* whether to transfer PEC */
    uint32_t ctl = 0U;

    ctl = I2C_CTL0(i2c_periph);
    ctl &= ~(I2C_CTL0_PECTRANS);
    ctl |= pecpara;
    I2C_CTL0(i2c_periph) = ctl;
}

/*!
    \brief      wait the flag status until timeout
    \param[in]  smbus_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags, refer to i2c_flag_enum
    \param[in]  status: the status of I2C flag to wait
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     none
*/
static int32_t _smbus_wait_flag_timeout(uint32_t smbus_periph, i2c_flag_enum flag, FlagStatus status, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;

    tick_start = hal_sys_basetick_count_get();
    /* wait flag status RESET */
    if(RESET == status) {
        while(SET == hals_i2c_flag_get(smbus_periph, flag)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    } else {
        /* wait flag status SET */
        while(RESET == hals_i2c_flag_get(smbus_periph, flag)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler in SMBUS master transmit mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smbus_master_transmit_interrupt(void *smbus)
{
    uint32_t length = 0;

    hal_smbus_dev_struct *p_smbus = smbus;
    hal_smbus_user_cb p_func = (hal_smbus_user_cb)p_smbus->tx_callback;

    length = p_smbus->txbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_SBSEND)) {
        /* send slave address */
        hals_i2c_master_addressing(p_smbus->periph, p_smbus->slave_address, SMBUS_TRANSMITTER);

    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_ADDSEND)) {
        /*clear ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_TBE)) {
        if(p_smbus->txbuffer.pos < length) {
            /* transmit smbus data */
            hals_i2c_data_transmit(p_smbus->periph, (*p_smbus->txbuffer.buffer & (uint8_t)0xFFU));

