PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smbus.c
            p_smbus->txbuffer.buffer++;
            p_smbus->txbuffer.pos++;

        } else if(p_smbus->txbuffer.pos == length) {
            /* transfer the pec value */
            p_smbus->txbuffer.pos++;
            hals_i2c_pec_transfer_config(p_smbus->periph, p_smbus->smbus_pec_transfer);
        } else {
            /* the master sends a stop condition to I2C bus */

            HAL_I2C_STOP_ON_BUS(p_smbus->periph);
            /* enable the I2C interrupt */
            hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_EV);
            hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_BUF);
            p_smbus->smbus_irq.event_handle = NULL;

            p_smbus->tx_state = HAL_SMBUS_STATE_READY;
        }
    }

    if(NULL != p_func) {
        p_func(p_smbus);
    }

}

/*!
    \brief      event handler in SMBUS slave transmit mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smbus_slave_transmit_interrupt(void *smbus)
{
    uint32_t length = 0;

    hal_smbus_dev_struct *p_smbus = smbus;

    length = p_smbus->txbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_ADDSEND)) {
        /* clear the ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
    } else if((hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_TBE)) && \
              (!hals_i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_AERR))) {
        if(p_smbus->txbuffer.pos < length) {
            /* transmit smbus data */
            hals_i2c_data_transmit(p_smbus->periph, (*p_smbus->txbuffer.buffer & (uint8_t)0xFFU));

            p_smbus->txbuffer.buffer++;
            p_smbus->txbuffer.pos++;
        } else if(p_smbus->txbuffer.pos == length) {
            /* transfer the pec value */
            hals_i2c_pec_transfer_config(p_smbus->periph, p_smbus->smbus_pec_transfer);

            hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_BUF);
            hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_EV);
            p_smbus->smbus_irq.event_handle = NULL;
            p_smbus->tx_state = HAL_SMBUS_STATE_READY;
        }
    }
}

/*!
    \brief      event handler in SMBUS master receive mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smbus_master_receive_interrupt(void *smbus)
{
    uint32_t length = 0;

    hal_smbus_dev_struct *p_smbus = smbus;

    length = p_smbus->rxbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_SBSEND)) {
        /* the master sends slave address */
        hals_i2c_master_addressing(p_smbus->periph, p_smbus->slave_address, SMBUS_RECEIVER);
    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_ADDSEND)) {
        if((length == 2) || (length == 1)) {
            /* clear the ACKEN before the ADDSEND is cleared, PEC mode do not need */
            if(p_smbus->smbus_pec_transfer != SMBUS_PECTRANS_ENABLE) {
                hals_i2c_ack_config(p_smbus->periph, I2C_ACK_DISABLE);
            }

            /* clear the ADDSEND bit */
            hals_i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
        } else {
            /* clear the ADDSEND bit */
            hals_i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
        }
    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_RBNE)) {
        if(p_smbus->rxbuffer.pos < length) {
            if(p_smbus->rxbuffer.pos == length - 3) {
                /* wait until the second last data byte is received into the shift register */
                while(!hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_BTC));
                /* send a NACK for the last data byte, PEC mode do not need */
                if(p_smbus->smbus_pec_transfer != SMBUS_PECTRANS_ENABLE) {
                    hals_i2c_ack_config(p_smbus->periph, I2C_ACK_DISABLE);
                }
            }
            /* read a data byte from I2C_DATA*/
            *p_smbus->rxbuffer.buffer = hals_i2c_data_receive(p_smbus->periph);

            p_smbus->rxbuffer.buffer++;
            p_smbus->rxbuffer.pos++;

            if(p_smbus->rxbuffer.pos == length) {
                hal_smbus_user_cb p_func = (hal_smbus_user_cb)p_smbus->rx_callback;
                /* wait until the RBNE bit is set */
                /* check the received PEC value */
                hals_i2c_pec_config(p_smbus->periph, p_smbus->smbus_pec_transfer);

                /* send a stop condition */
                HAL_I2C_STOP_ON_BUS(p_smbus->periph);
                hals_i2c_ack_config(p_smbus->periph, I2C_ACK_ENABLE);
                hals_i2c_ackpos_config(p_smbus->periph, I2C_ACKPOS_CURRENT);

                p_smbus->rx_state = HAL_SMBUS_STATE_READY;
                p_smbus->smbus_irq.event_handle = NULL;
                /* disable the I2C0 interrupt */
                hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_BUF);
                hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_EV);

                if(NULL != p_func) {
                    p_func(p_smbus);
                }
            }
        }
    }

}

/*!
    \brief      event handler in SMBUS slave receive mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smbus_slave_receive_interrupt(void *smbus)
{
    uint32_t length = 0;
    hal_smbus_dev_struct *p_smbus = smbus;

    length = p_smbus->txbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_ADDSEND)) {
        /* clear the ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_RBNE)) {
        /* if reception data register is not empty ,I2Cx will read a data from I2C_DATA */
        *p_smbus->rxbuffer.buffer = hals_i2c_data_receive(p_smbus->periph);
        p_smbus->rxbuffer.buffer++;
        p_smbus->rxbuffer.pos++;

        if(p_smbus->rxbuffer.pos == length) {
            /* check the received PEC value */
            hals_i2c_pec_transfer_config(p_smbus->periph, p_smbus->smbus_pec_transfer);
        }
    } else if(hals_i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_STPDET)) {
        hal_smbus_user_cb p_func = (hal_smbus_user_cb)p_smbus->rx_callback;
        /* clear the STPDET bit */
        HAL_I2C_ENABLE(p_smbus->periph);

        p_smbus->smbus_irq.event_handle = NULL;
        p_smbus->rx_state = HAL_SMBUS_STATE_READY;

        /* disable I2Cx interrupt */
        hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_BUF);
        hals_i2c_interrupt_disable(p_smbus->periph, I2C_INT_EV);

        if(NULL != p_func) {
            p_func(p_smbus);
        }
    }
}
